---
title: "Group A Time Series With pandas"
author: "Chris Albon"
date: 2017-12-20T11:53:49-07:00
description: "Group a time series with pandas."
type: technical_note
draft: false
---

### Import required modules

In [79]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity='all'

In [80]:
import pandas as pd
import numpy as np

### Create a dataframe

In [81]:
df = pd.DataFrame()

df['german_army'] = np.random.randint(low=20000, high=30000, size=100)
df['allied_army'] = np.random.randint(low=20000, high=40000, size=100)
df.index = pd.date_range('1/1/2014', periods=100, freq='H')

df.head()

                     german_army  allied_army
2014-01-01 00:00:00        21676        21974
2014-01-01 01:00:00        27294        36775
2014-01-01 02:00:00        29855        29978
2014-01-01 03:00:00        28393        27714
2014-01-01 04:00:00        29806        34676

### Truncate the dataframe

In [82]:
tdf=df.truncate(before='1/2/2014', after='1/3/2014')
tdf

                     german_army  allied_army
2014-01-02 00:00:00        25083        22089
2014-01-02 01:00:00        25898        39260
2014-01-02 02:00:00        21390        21209
2014-01-02 03:00:00        29456        30469
2014-01-02 04:00:00        28623        38935
2014-01-02 05:00:00        26690        27430
2014-01-02 06:00:00        24912        32044
2014-01-02 07:00:00        23713        25518
2014-01-02 08:00:00        26113        29504
2014-01-02 09:00:00        20257        27308
2014-01-02 10:00:00        24919        30981
2014-01-02 11:00:00        20479        30304
2014-01-02 12:00:00        24375        21767
2014-01-02 13:00:00        27910        33591
2014-01-02 14:00:00        28816        28114
2014-01-02 15:00:00        24707        38870
2014-01-02 16:00:00        22815        39053
2014-01-02 17:00:00        21119        31302
2014-01-02 18:00:00        20816        36810
2014-01-02 19:00:00        21300        20634
2014-01-02 20:00:00        20644        36265
2014-01-02 21:00:00        28186        29863
2014-01-02 22:00:00        26966        30068
2014-01-02 23:00:00        22520        33413
2014-01-03 00:00:00        25200        33260

In [83]:
tdf.size
df['1/2/2014':'1/3/2014 00'].size
df['1/2/2014':'2014-01-03 00'].size
df['2014-01-02':'2014-01-03 00'].size

50

50

50

50

### Set the dataframe's index

In [84]:
df.head()

                     german_army  allied_army
2014-01-01 00:00:00        21676        21974
2014-01-01 01:00:00        27294        36775
2014-01-01 02:00:00        29855        29978
2014-01-01 03:00:00        28393        27714
2014-01-01 04:00:00        29806        34676

In [111]:
df.index = df.index + pd.DateOffset(months=4, days=5)
# df.index = df.index + pd.DateOffset(months=4, days=5,years=1,hours=1,minutes=1,seconds=1)

In [128]:
df.index[:5]
set(df.index.year)
set(df.index.month)
set(df.index.day)
set(df.index.hour)
set(df.index.minute)
set(df.index.second)
len(set(df.index.hour))

DatetimeIndex(['2023-10-25 04:03:02', '2023-10-25 05:03:02',
               '2023-10-25 06:03:02', '2023-10-25 07:03:02',
               '2023-10-25 08:03:02'],
              dtype='datetime64[ns]', freq='H')

{2023}

{10}

{25, 26, 27, 28, 29}

{0,
 1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 11,
 12,
 13,
 14,
 15,
 16,
 17,
 18,
 19,
 20,
 21,
 22,
 23}

{3}

{2}

24

### View the dataframe

In [110]:
df.head()

                     german_army  allied_army
2023-06-20 04:03:02        21676        21974
2023-06-20 05:03:02        27294        36775
2023-06-20 06:03:02        29855        29978
2023-06-20 07:03:02        28393        27714
2023-06-20 08:03:02        29806        34676

### Lead a variable 1 hour

In [88]:
df.shift(1).head()

                     german_army  allied_army
2014-05-06 00:00:00          NaN          NaN
2014-05-06 01:00:00      21676.0      21974.0
2014-05-06 02:00:00      27294.0      36775.0
2014-05-06 03:00:00      29855.0      29978.0
2014-05-06 04:00:00      28393.0      27714.0

### Lag a variable 1 hour

In [89]:
df.shift(-1).tail()

                     german_army  allied_army
2014-05-09 23:00:00      23947.0      21194.0
2014-05-10 00:00:00      22804.0      37565.0
2014-05-10 01:00:00      27091.0      28424.0
2014-05-10 02:00:00      27888.0      28022.0
2014-05-10 03:00:00          NaN          NaN

### Aggregate into days by summing up the value of each hourly observation

In [90]:
df.resample('D').sum()

            german_army  allied_army
2014-05-06       603561       671433
2014-05-07       587707       734801
2014-05-08       602719       716901
2014-05-09       603912       704034
2014-05-10       101730       115205

### Aggregate into days by averaging up the value of each hourly observation

In [91]:
df.resample('D').mean()

             german_army   allied_army
2014-05-06  25148.375000  27976.375000
2014-05-07  24487.791667  30616.708333
2014-05-08  25113.291667  29870.875000
2014-05-09  25163.000000  29334.750000
2014-05-10  25432.500000  28801.250000

### Aggregate into days by taking the min value up the value of each hourly observation

In [92]:
df.resample('D').median()

            german_army  allied_army
2014-05-06      24499.0      25848.5
2014-05-07      24809.5      30386.5
2014-05-08      25317.5      27957.5
2014-05-09      24957.0      29870.0
2014-05-10      25519.0      28223.0

### Aggregate into days by taking the median value of each day's worth of hourly observation

In [93]:
df.resample('D').median()

            german_army  allied_army
2014-05-06      24499.0      25848.5
2014-05-07      24809.5      30386.5
2014-05-08      25317.5      27957.5
2014-05-09      24957.0      29870.0
2014-05-10      25519.0      28223.0

### Aggregate into days by taking the first value of each day's worth of hourly observation

In [94]:
df.resample('D').first()

            german_army  allied_army
2014-05-06        21676        21974
2014-05-07        25083        22089
2014-05-08        25200        33260
2014-05-09        27391        38805
2014-05-10        23947        21194

### Aggregate into days by taking the last value of each day's worth of hourly observation

In [95]:
df.resample('D').last()

            german_army  allied_army
2014-05-06        24822        22852
2014-05-07        22520        33413
2014-05-08        23963        39108
2014-05-09        29741        25634
2014-05-10        27888        28022

### Aggregate into days by taking the first, last, highest, and lowest value of each day's worth of hourly observation

In [96]:
df.resample('D').ohlc()

           german_army                      allied_army
                  open   high    low  close        open   high    low  close
2014-05-06       21676  29855  20205  24822       21974  37722  21140  22852
2014-05-07       25083  29456  20257  22520       22089  39260  20634  33413
2014-05-08       25200  29679  20100  23963       33260  39108  20545  39108
2014-05-09       27391  29741  20162  29741       38805  39297  20558  25634
2014-05-10       23947  27888  22804  27888       21194  37565  21194  28022